In [1]:
import pandas as pd
import json

In [2]:
data = open('d:\data_soal3.json', 'r')
dataread = data.read()
dataset = json.loads(dataread)

In [3]:
# Question A

soal1 = pd.json_normalize(dataset, 
                  record_path=['txs'], 
                  meta=[['user', 'id'], ['user', 'name'], ['user','email']])

In [4]:
soal1.rename(columns={'id':'tx_id', 'user.id':'user_id'}, inplace=True)
soal1

   tx_id     tx_date  tx_amount tx_type user_id user.name        user.email
0      1  2020-01-01         10     buy       1      agus  agus@example.com
1      3  2020-02-01         10     buy       1      agus  agus@example.com
2      5  2020-03-01         20    sell       1      agus  agus@example.com
3      2  2020-01-01         10    sell       2      asep  asep@example.com
4      4  2020-02-01         10    sell       2      asep  asep@example.com
5      6  2020-03-01         20     buy       2      asep  asep@example.com

In [5]:
CSV_soal1 = soal1[['user_id', 'tx_id']]
CSV_soal1

  user_id  tx_id
0       1      1
1       1      3
2       1      5
3       2      2
4       2      4
5       2      6

In [6]:
CSV_soal1.to_csv('soal3_a.csv')

In [7]:
#Question B

soal2 = pd.json_normalize(dataset)
soal2

,txs,user.id,user.name,user.email
0,"[{'id': 1, 'tx_date': '2020-01-01', 'tx_amount...",1,agus,agus@example.com
1,"[{'id': 2, 'tx_date': '2020-01-01', 'tx_amount...",2,asep,asep@example.com

In [8]:
soal2.rename(columns={'user.id':'id', 'user.name':'name', 'user.email':'email'}, inplace=True)
soal2

,txs,id,name,email
0,"[{'id': 1, 'tx_date': '2020-01-01', 'tx_amount...",1,agus,agus@example.com
1,"[{'id': 2, 'tx_date': '2020-01-01', 'tx_amount...",2,asep,asep@example.com

In [9]:
CSV_soal2 = soal2[['id', 'name', 'email']]
CSV_soal2

   id  name             email
0   1  agus  agus@example.com
1   2  asep  asep@example.com

In [10]:
CSV_soal2.to_csv('soal3_b.csv')

In [11]:
#Question C
CSV_soal3 = soal1[['tx_id', 'tx_date', 'tx_amount', 'tx_type']]

In [12]:
CSV_soal3.rename(columns={'tx_id':'id'}, inplace=True)
CSV_soal3

C:\Users\THINKPAD E470\anaconda3\lib\site-packages\pandas\core\frame.py:4441: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  return super().rename(

   id     tx_date  tx_amount tx_type
0   1  2020-01-01         10     buy
1   3  2020-02-01         10     buy
2   5  2020-03-01         20    sell
3   2  2020-01-01         10    sell
4   4  2020-02-01         10    sell
5   6  2020-03-01         20     buy

In [13]:
CSV_soal3.to_csv('soal3_c.csv')